[
  {
    "id": "d645abe4-17c7-4d46-8401-1a7021d16489",
    "name": "The Lord of the Rings Volume 1",
    "author": "J. R. R. Tolkien",
    "totalCopies": 3,
    "thumbnailUrl": "https://m.media-amazon.com/images/I/51Sjlp7jUDL._SY264_BO1,204,203,200_QL40_FMwebp_.jpg",
    "availableCopies": 2,
    "description": "The Fellowship of the Ring is the first of the three volumes that comprise The Lord of the Rings novel. Set in a mythical universe of Middle-earth, this book continues in the same tone as The Hobbit. The Dark Lord, Sauron, is the Lord of the Rings, who is on a mission to reclaim the One Ring and use it to enslave all of Middle-earth.The Fellowship Of The Ring commences with a birthday party in Hobbiton. Bilbo Baggins, the current possessor of the Ring, turns 111 and bequeaths the ring to his cousin, Frodo Baggins. Several years pass and the wizard Gandalf routinely visits Frodo in Bag End. One spring night, he tells Frodo the truth about the Ring and the story behind it. He informs him that Sauron has risen again and is in search of the Ring. Upon learning this, Frodo departs from the Shire alongside three Hobbit friends: Sam, Merry and Pippin.Along the way, the four of them are faced with several obstacles and distractions, including Ringwraiths, who are the servants of Sauron, a malevolent willow tree and an evil tomb ghost. The group befriends wandering Elves on the way and set upon their path across Middle-earth to the Cracks of Doom, intending to destroy the Ring and foil the Dark Lords plan.The Fellowship of the Ring was published as Film tie-in edition by HarperCollins in 2012 and is available in paperback.Key Features: This book was first published in 1954 in the United Kingdom. This novel is succeeded by The Two Towers and The Return of the King."
  },
  {
    "id": "bd3b4722-7503-47db-b1fb-8324122d637b",
    "name": "The Lord of the Rings Volume 2",
    "author": "J. R. R. Tolkien",
    "thumbnailUrl": "https://m.media-amazon.com/images/I/41HkOD2+e1L.jpg",
    "totalCopies": 3,
    "availableCopies": 1,
    "description": "Continuing the story of The Hobbit, this is the second part of Tolkien's epic masterpiece, The Lord of the Rings. Frodo and the Companions of the Ring have been beset by danger during their quest to prevent the ruling ring from falling into the hands of the Dark Lord by destroying it in the cracks of doom. They have lost the wizard, Gandalf, in the battle with an evil spirit in the Mines of Moria and at the Falls of Rauros, Boromir, seduced by the power of the Ring, tried to seize it by force. While Frodo and Sam made their escape the rest of the company were attacked by Orcs. Now they continue their journey alone down the great River Anduin - alone, that is, save for the mysterious creeping figure that follows wherever they go."
  },
  {
    "id": "a40bbba5-ca65-4ac6-9977-cbd0d43e5d79",
    "name": "The Lord of the Rings Volume 3",
    "author": "J. R. R. Tolkien",
    "thumbnailUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1654216226i/61215384.jpg",
    "totalCopies": 3,
    "availableCopies": 3,
    "description": "Concluding the story begun in The Hobbit, this is the final part of Tolkien's epic masterpiece, The Lord of the Rings. The armies of the Dark Lord Sauron are massing as his evil shadow spreads ever wider. Men, Dwarves, Elves and Ents unite forces to do battle agains the Dark. Meanwhile, Frodo and Sam struggle further into Mordor in their heroic quest to destroy the One Ring. The devastating conclusion of J.R.R. Tolkien's classic tale of magic and adventure, begun in The Fellowship of the Ring and The Two Towers."
  }
]
